## Terraform Plan

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.portfolio_static_site has been deleted
  - resource "aws_s3_bucket" "portfolio_static_site" {
      - arn                         = "arn:aws:s3:::leandrodeobarbosa-portfolio" -> null
      - id                          = "leandrodeobarbosa-portfolio" -> null
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.portfolio_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "portfolio_certificate" {
        id                        = "arn:aws:acm:us-east-1:320789259849:certificate/0ea47dd2-6bc9-416f-ad32-02e2fa681698"
        tags                      = {
            "Component" = "acm"
            "Usage"     = "cloudfront-ssl"
        }
      ~ tags_all                  = {
          + "Test"        = "ci-pipeline"
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.portfolio will be updated in-place
  ~ resource "aws_cloudfront_distribution" "portfolio" {
        id                             = "E3HAAHI83AZI76"
        tags                           = {}
      ~ tags_all                       = {
          + "Test"        = "ci-pipeline"
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.portfolio_static_site will be created
  + resource "aws_s3_bucket" "portfolio_static_site" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "leandrodeobarbosa-portfolio"
      + bucket_domain_name          = (known after apply)
      + bucket_namespace            = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "leandro"
          + "Project"     = "portfolio"
          + "Test"        = "ci-pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.portfolio_static_site must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "portfolio_static_site" {
      ~ bucket                                 = "leandrodeobarbosa-portfolio" # forces replacement -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "leandrodeobarbosa-portfolio" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.portfolio_static_site must be replaced
-/+ resource "aws_s3_bucket_policy" "portfolio_static_site" {
      ~ bucket = "leandrodeobarbosa-portfolio" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "leandrodeobarbosa-portfolio" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - ArnLike = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::320789259849:distribution/E3HAAHI83AZI76"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::leandrodeobarbosa-portfolio/*"
                      - Sid       = "AllowCloudFrontServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_public_access_block.portfolio_static_site must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "portfolio_static_site" {
      ~ bucket                  = "leandrodeobarbosa-portfolio" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "leandrodeobarbosa-portfolio" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_versioning.portfolio_static_site must be replaced
-/+ resource "aws_s3_bucket_versioning" "portfolio_static_site" {
      ~ bucket = "leandrodeobarbosa-portfolio" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "leandrodeobarbosa-portfolio" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 2 to change, 4 to destroy.

Changes to Outputs:
  ~ bucket_arn                                = "arn:aws:s3:::leandrodeobarbosa-portfolio" -> (known after apply)

```